{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Добрый день,вот точная формулировка задачи о теплых днях (в прошлом году она была немного позже):\n",
    "Обратите внимание на ограничение по времени. Пока можно подумать как это делать алгоритмически, а потом(когда пройдем списки) реализовать.\n",
    "\n",
    "Ноябрь длится n дней (n около миллиона или чуть меньше) мы заранее знаем температуру всех дней ноября, например, (для примера я списал данные вот отсюда, но, вообще-то, там могут быть любые целые числа https://pogoda.mail.ru/prognoz/kazan/november-2021/):\n",
    "+9,+7,+4,+4,+4,+8,+5,+5,+5,+6, 0, 0, 0,+1, 0,-5,-4,-3, 0, 0,-1,-1,-2,-8,-7,-1,+4,+1,-1,+1,+1.\n",
    "\n",
    "Нужно сказать людям через сколько дней наступит день более теплый, чем текущий.\n",
    "Например, для массива температур выше ответ будет выглядеть так:\n",
    "None,4,3,2,1,None,3,2,1,None,3,2,1,13,12,1,1,1,8,7,6,5,3,1,1,1,None,None,1,None,None,\n",
    "где None означает, что более теплого дня в ноябре мы больше не дождемся.\n",
    "\n",
    "Написать программу, выдающую ответ за время O(n) (можно использовать такую же дополнительную память)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[None, 4, 3, 2, 1, None, 3, 2, 1, None, 3, 2, 1, 3, 2, 1, None, 1, 1, 8, 7, 6, 5, 3, 1, 1, 1, None, None, 1, None, None]\n"
     ]
    }
   ],
   "source": [
    "l = [+9, +7, +4, +4, +4, +8, +5, +5, +5, +6, 0, 0, 0, +1, 0, -5,\n",
    "     5, -4, -3, 0, 0, -1, -1, -2, -8, -7, -1, +4, +1, -1, +1, +1]\n",
    "n = len(l)\n",
    "st = []\n",
    "res = [None]*n\n",
    "\n",
    "for i in range(n-1):\n",
    "    while (st and l[i] > l[st[-1]]):\n",
    "        res[st[-1]] = i-st[-1]\n",
    "        st.pop()\n",
    "    if (l[i] < l[i+1]):\n",
    "        res[i] = 1\n",
    "    else:\n",
    "        st.append(i)\n",
    "print(res)\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Эксперементально найти шансы коллизии в игры \"Фанты\"\n",
    "n человек пишут n фантов (заданий)\n",
    "Затем эти люди берут фант(если человек достал свой фант, это называется Коллизией)\n",
    "\n",
    "исп. enamurate\n",
    "Подключить random as rand\n",
    "all\n",
    "any\n",
    "провести миллион экспериментов\n",
    "Ответ будет обратным к мировой константе\n",
    "\n",
    "\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.7 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.7"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "87fa829485d475267f3e6278171c7267e46e15927450fa4eed8e02cd2004c4dd"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
